{
    "types": [
        {
            "id": 0,
            "category": 0,
            "name": "Nitroglycerin",
            "description": "Nitroglycerin is a heavy, colorless, oily, explosive liquid most commonly produced by nitrating glycerol with white fuming nitric acid under conditions appropriate to the formation of the nitric acid ester."
        },
        {
            "id": 1,
            "category": 0,
            "name": "Acetone peroxide",
            "description": "Acetone peroxide is an organic peroxide and a primary high explosive. It is produced by the oxidation of acetone to yield a mixture of linear monomer and cyclic dimer, trimer, and tetramer forms."
        },
        {
            "id": 2,
            "category": 0,
            "name": "TNT",
            "description": "Trinitrotoluene is a yellow solid sometimes used as a reagent in chemical synthesis, but it is best known as an explosive material with convenient handling properties."
        },
        {
            "id": 3,
            "category": 1,
            "name": "Flash powder",
            "description": "Flash powder is a pyrotechnic composition which burns quickly and if confined produces a loud report. It is widely used in theatrical pyrotechnics and fireworks and was once used for flashes in photography."
        },
        {
            "id": 4,
            "category": 1,
            "name": "Sprengel explosive",
            "description": "Sprengel explosives are a generic class of materials invented by Hermann Sprengel in the 1870s. They consist of stoichiometric mixtures of strong oxidisers and reactive fuels, mixed just prior to use in order to enhance safety."
        },
        {
            "id": 5,
            "category": 1,
            "name": "Gunpowder",
            "description": "Gunpowder, also known as black powder to distinguish it from modern smokeless gunpowder, is the earliest known chemical explosive. It consists of a mixture of sulfur, charcoal, and potassium nitrate."
        }
    ]
}